

export const kievNeighborhoodsAndMetros = [
   "Правый берег",
   "Левый берег",
   "Академгородок",
   "Арсенальная",
   "Берестейская",
   "Бориспольская",
   "Васильковская",
   "Вокзальная",
   "Выдубичи",
   "Выставочный центр",
   "Героев Днепра",
   "Гидропарк",
   "Голосеевская",
   "Дарница",
   "Демеевская",
   "Днепр",
   "Дорогожичи",
   "Житомирская",
   "Золотые ворота",
   "Ипподром",
   "Кловская",
   "Контрактовая площадь",
   "Красный хутор",
   "Крещатик",
   "Левобережная",
   "Лесная",
   "Лукьяновская",
   "Лыбедская",
   "Майдан Незалежности",
   "Минская",
   "Нивки",
   "Оболонь",
   "Олимпийская",
   "Осокорки",
   "Палац «Украина»",
   "Палац спорта",
   "Почайна",
   "Площадь Льва Толстого",
   "Позняки",
   "Политехнический институт",
   "Святошин",
   "Славутич",
   "Сырец",
   "Тараса Шевченко",
   "Театральная",
   "Теремки",
   "Университет",
   "Харьковская",
   "Черниговская",
   "Шулявская",
   "Голосеевский",
   "Дарницкий",
   "Деснянский",
   "Днепровский",
   "Оболонский",
   "Печерский",
   "Подольский",
   "Святошинский",
   "Соломенский",
   "Шевченковский"
]

export const servicesList = [
   "Секс классический",
   "Секс анальный",
   "Секс групповой",
   "Секс лесбийский",
   "Минет в презервативе",
   "Минет без презерватива",
   "Минет глубокий",
   "Куннилингус",
   "Секс игрушки",
   "Ролевые игры",
   "Услуги семейной паре",
   "Окончание на грудь",
   "Окончание на лицо",
   "Окончание в рот",
   "Фото/видео съемка",
   "Минет в машине",
   "Эскорт",
   "Страпон",
   "Анилингус делаю",
   "Золотой дождь выдача",
   "Золотой дождь прием",
   "Копро выдача",
   "Фистинг анальный",
   "Фистинг классическийа",
   "Стриптиз профи",
   "Стриптиз не профи",
   "Лесби откровенное",
   "Лесби-шоу легкое",
   "Массаж расслабляющий",
   "Массаж классический",
   "Массаж профи",
   "Массаж тайский",
   "Массаж урологический",
   "Массаж точечный",
   "Массаж эротический",
   "Массаж ветка сакуры",
   "Бондаж",
   "Госпожа",
   "Рабыня",
   "БДСМ игры",
   "Легкая доминация",
   "Порка",
   "Фетиш",
   "Трамплинг"
]

export const packages =  {
   standard: {
      title: 'Стандарт',
      price: 30
   },
   premium: {
      title: 'Премиум',
      price: 50
   },
   vip: {
      title: 'VIP',
      price: 80
   }
};

// export const packageArray = Object.entries(packages).map(([key, data]) => ({
//    key,        // e.g. "standard"
//    title: data.title,
//    price: data.price
// }));

export const plans = {
   basic: {
      prices: {
         '1_month': 25,
         '2_month': 45,
         '3_month': 60
      }
   },
   premium: {
      prices: {
         '1_month': 40,
         '2_month': 72,
         '3_month': 96
      }
   },
   vip: {
      prices: {
         '1_month': 50,
         '2_month': 90,
         '3_month': 120
      }
   }
}
